{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_48", "output_dim": 1024, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 96, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 96]}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_26"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_33"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_49", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 256}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_27"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_34"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_50", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 64}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_28"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_35"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_51", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 64, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_29"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_36"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_52", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 16, "b_regularizer": null, "W_regularizer": null, "activation": "hard_sigmoid", "output_dim": 1}}]}